Revit 2026 API

# RebarSpliceGeometrySpliceOrigin Property

---

Identifies the splice face origin.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public XYZ SpliceOrigin { get; set; }
```
```vb
Public Property SpliceOrigin As XYZ
	Get
	Set
```
```cpp
public:
property XYZ^ SpliceOrigin {
	XYZ^ get ();
	void set (XYZ^ value);
}
```
```fsharp
member SpliceOrigin : XYZ with get, set
```

#### Property Value

XYZ

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

#### Reference

RebarSpliceGeometry Class

Autodesk.Revit.DB.Structure Namespace